layer {
  name: "train-data"
  type: "Python"
  top: "data"
  top: "labels"
  include {
    phase: TRAIN
  }
  python_param {
    module: "caffe.multilabelDataLayer"
    layer: "MultilabelDataLyer"
    param_str: "{\"scale-to-width\":224,\"scale-to-height\":224,\"batch_size\":16,\"channel\":3,\"db_file\":\"r_dataset5v.csv\"}"
  }
}
layer {
  name: "val-data"
  type: "Python"
  top: "data"
  top: "labels"
  include {
    phase: TEST
  }
  python_param {
    module: "caffe.multilabelDataLayer"
    layer: "MultilabelDataLyer"
    param_str: "{\"scale-to-width\":224,\"scale-to-height\":224,\"batch_size\":32,\"channel\":3,\"db_file\":\"r_dataset4t.csv\"}"
  }
}
layer {
  name: "split_label"
  type: "Slice"
  bottom: "labels"
  top: "lbl_hands"
  top: "lbl_gesture"
  slice_param {
    slice_point: 1
    axis: 1
  }
}
layer {
  name: "bump_1/conv1/7x7_s2"
  type: "Convolution"
  bottom: "data"
  top: "bump_1/conv1/7x7_s2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/conv1/relu_7x7"
  type: "ReLU"
  bottom: "bump_1/conv1/7x7_s2"
  top: "bump_1/conv1/7x7_s2"
}
layer {
  name: "bump_1/pool1/3x3_s2"
  type: "Pooling"
  bottom: "bump_1/conv1/7x7_s2"
  top: "bump_1/pool1/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "bump_1/pool1/norm1"
  type: "LRN"
  bottom: "bump_1/pool1/3x3_s2"
  top: "bump_1/pool1/norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "bump_1/conv2/3x3_reduce"
  type: "Convolution"
  bottom: "bump_1/pool1/norm1"
  top: "bump_1/conv2/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/conv2/relu_3x3_reduce"
  type: "ReLU"
  bottom: "bump_1/conv2/3x3_reduce"
  top: "bump_1/conv2/3x3_reduce"
}
layer {
  name: "bump_1/conv2/3x3"
  type: "Convolution"
  bottom: "bump_1/conv2/3x3_reduce"
  top: "bump_1/conv2/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/conv2/relu_3x3"
  type: "ReLU"
  bottom: "bump_1/conv2/3x3"
  top: "bump_1/conv2/3x3"
}
layer {
  name: "bump_1/conv2/norm2"
  type: "LRN"
  bottom: "bump_1/conv2/3x3"
  top: "bump_1/conv2/norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "bump_1/pool2/3x3_s2"
  type: "Pooling"
  bottom: "bump_1/conv2/norm2"
  top: "bump_1/pool2/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "bump_1/inception_3a/1x1"
  type: "Convolution"
  bottom: "bump_1/pool2/3x3_s2"
  top: "bump_1/inception_3a/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_3a/relu_1x1"
  type: "ReLU"
  bottom: "bump_1/inception_3a/1x1"
  top: "bump_1/inception_3a/1x1"
}
layer {
  name: "bump_1/inception_3a/3x3_reduce"
  type: "Convolution"
  bottom: "bump_1/pool2/3x3_s2"
  top: "bump_1/inception_3a/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.09
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_3a/3x3_reduce"
  top: "bump_1/inception_3a/3x3_reduce"
}
layer {
  name: "bump_1/inception_3a/3x3"
  type: "Convolution"
  bottom: "bump_1/inception_3a/3x3_reduce"
  top: "bump_1/inception_3a/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_3a/relu_3x3"
  type: "ReLU"
  bottom: "bump_1/inception_3a/3x3"
  top: "bump_1/inception_3a/3x3"
}
layer {
  name: "bump_1/inception_3a/5x5_reduce"
  type: "Convolution"
  bottom: "bump_1/pool2/3x3_s2"
  top: "bump_1/inception_3a/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.2
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_3a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_3a/5x5_reduce"
  top: "bump_1/inception_3a/5x5_reduce"
}
layer {
  name: "bump_1/inception_3a/5x5"
  type: "Convolution"
  bottom: "bump_1/inception_3a/5x5_reduce"
  top: "bump_1/inception_3a/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_3a/relu_5x5"
  type: "ReLU"
  bottom: "bump_1/inception_3a/5x5"
  top: "bump_1/inception_3a/5x5"
}
layer {
  name: "bump_1/inception_3a/pool"
  type: "Pooling"
  bottom: "bump_1/pool2/3x3_s2"
  top: "bump_1/inception_3a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "bump_1/inception_3a/pool_proj"
  type: "Convolution"
  bottom: "bump_1/inception_3a/pool"
  top: "bump_1/inception_3a/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_3a/relu_pool_proj"
  type: "ReLU"
  bottom: "bump_1/inception_3a/pool_proj"
  top: "bump_1/inception_3a/pool_proj"
}
layer {
  name: "bump_1/inception_3a/output"
  type: "Concat"
  bottom: "bump_1/inception_3a/1x1"
  bottom: "bump_1/inception_3a/3x3"
  bottom: "bump_1/inception_3a/5x5"
  bottom: "bump_1/inception_3a/pool_proj"
  top: "bump_1/inception_3a/output"
}
layer {
  name: "bump_1/inception_3b/1x1"
  type: "Convolution"
  bottom: "bump_1/inception_3a/output"
  top: "bump_1/inception_3b/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_3b/relu_1x1"
  type: "ReLU"
  bottom: "bump_1/inception_3b/1x1"
  top: "bump_1/inception_3b/1x1"
}
layer {
  name: "bump_1/inception_3b/3x3_reduce"
  type: "Convolution"
  bottom: "bump_1/inception_3a/output"
  top: "bump_1/inception_3b/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.09
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_3b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_3b/3x3_reduce"
  top: "bump_1/inception_3b/3x3_reduce"
}
layer {
  name: "bump_1/inception_3b/3x3"
  type: "Convolution"
  bottom: "bump_1/inception_3b/3x3_reduce"
  top: "bump_1/inception_3b/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_3b/relu_3x3"
  type: "ReLU"
  bottom: "bump_1/inception_3b/3x3"
  top: "bump_1/inception_3b/3x3"
}
layer {
  name: "bump_1/inception_3b/5x5_reduce"
  type: "Convolution"
  bottom: "bump_1/inception_3a/output"
  top: "bump_1/inception_3b/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.2
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_3b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_3b/5x5_reduce"
  top: "bump_1/inception_3b/5x5_reduce"
}
layer {
  name: "bump_1/inception_3b/5x5"
  type: "Convolution"
  bottom: "bump_1/inception_3b/5x5_reduce"
  top: "bump_1/inception_3b/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_3b/relu_5x5"
  type: "ReLU"
  bottom: "bump_1/inception_3b/5x5"
  top: "bump_1/inception_3b/5x5"
}
layer {
  name: "bump_1/inception_3b/pool"
  type: "Pooling"
  bottom: "bump_1/inception_3a/output"
  top: "bump_1/inception_3b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "bump_1/inception_3b/pool_proj"
  type: "Convolution"
  bottom: "bump_1/inception_3b/pool"
  top: "bump_1/inception_3b/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_3b/relu_pool_proj"
  type: "ReLU"
  bottom: "bump_1/inception_3b/pool_proj"
  top: "bump_1/inception_3b/pool_proj"
}
layer {
  name: "bump_1/inception_3b/output"
  type: "Concat"
  bottom: "bump_1/inception_3b/1x1"
  bottom: "bump_1/inception_3b/3x3"
  bottom: "bump_1/inception_3b/5x5"
  bottom: "bump_1/inception_3b/pool_proj"
  top: "bump_1/inception_3b/output"
}
layer {
  name: "bump_1/pool3/3x3_s2"
  type: "Pooling"
  bottom: "bump_1/inception_3b/output"
  top: "bump_1/pool3/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "bump_1/inception_4a/1x1"
  type: "Convolution"
  bottom: "bump_1/pool3/3x3_s2"
  top: "bump_1/inception_4a/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4a/relu_1x1"
  type: "ReLU"
  bottom: "bump_1/inception_4a/1x1"
  top: "bump_1/inception_4a/1x1"
}
layer {
  name: "bump_1/inception_4a/3x3_reduce"
  type: "Convolution"
  bottom: "bump_1/pool3/3x3_s2"
  top: "bump_1/inception_4a/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.09
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_4a/3x3_reduce"
  top: "bump_1/inception_4a/3x3_reduce"
}
layer {
  name: "bump_1/inception_4a/3x3"
  type: "Convolution"
  bottom: "bump_1/inception_4a/3x3_reduce"
  top: "bump_1/inception_4a/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 208
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4a/relu_3x3"
  type: "ReLU"
  bottom: "bump_1/inception_4a/3x3"
  top: "bump_1/inception_4a/3x3"
}
layer {
  name: "bump_1/inception_4a/5x5_reduce"
  type: "Convolution"
  bottom: "bump_1/pool3/3x3_s2"
  top: "bump_1/inception_4a/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.2
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_4a/5x5_reduce"
  top: "bump_1/inception_4a/5x5_reduce"
}
layer {
  name: "bump_1/inception_4a/5x5"
  type: "Convolution"
  bottom: "bump_1/inception_4a/5x5_reduce"
  top: "bump_1/inception_4a/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 48
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4a/relu_5x5"
  type: "ReLU"
  bottom: "bump_1/inception_4a/5x5"
  top: "bump_1/inception_4a/5x5"
}
layer {
  name: "bump_1/inception_4a/pool"
  type: "Pooling"
  bottom: "bump_1/pool3/3x3_s2"
  top: "bump_1/inception_4a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "bump_1/inception_4a/pool_proj"
  type: "Convolution"
  bottom: "bump_1/inception_4a/pool"
  top: "bump_1/inception_4a/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4a/relu_pool_proj"
  type: "ReLU"
  bottom: "bump_1/inception_4a/pool_proj"
  top: "bump_1/inception_4a/pool_proj"
}
layer {
  name: "bump_1/inception_4a/output"
  type: "Concat"
  bottom: "bump_1/inception_4a/1x1"
  bottom: "bump_1/inception_4a/3x3"
  bottom: "bump_1/inception_4a/5x5"
  bottom: "bump_1/inception_4a/pool_proj"
  top: "bump_1/inception_4a/output"
}
layer {
  name: "bump_1/loss1/ave_pool"
  type: "Pooling"
  bottom: "bump_1/inception_4a/output"
  top: "bump_1/loss1/ave_pool"
  pooling_param {
    pool: AVE
    kernel_size: 5
    stride: 3
  }
}
layer {
  name: "bump_1/loss1/conv"
  type: "Convolution"
  bottom: "bump_1/loss1/ave_pool"
  top: "bump_1/loss1/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.08
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/loss1/relu_conv"
  type: "ReLU"
  bottom: "bump_1/loss1/conv"
  top: "bump_1/loss1/conv"
}
layer {
  name: "bump_1/loss1/fc"
  type: "InnerProduct"
  bottom: "bump_1/loss1/conv"
  top: "bump_1/loss1/fc"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
      std: 0.02
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/loss1/relu_fc"
  type: "ReLU"
  bottom: "bump_1/loss1/fc"
  top: "bump_1/loss1/fc"
}
layer {
  name: "bump_1/loss1/drop_fc"
  type: "Dropout"
  bottom: "bump_1/loss1/fc"
  top: "bump_1/loss1/fc"
  dropout_param {
    dropout_ratio: 0.7
  }
}
layer {
  name: "bump_1/loss1/classifier"
  type: "InnerProduct"
  bottom: "bump_1/loss1/fc"
  top: "bump_1/loss1/classifier"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 20
    weight_filler {
      type: "xavier"
      std: 0.0009765625
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "bump_1/loss1/loss"
  type: "SoftmaxWithLoss"
  bottom: "bump_1/loss1/classifier"
  bottom: "bump_1/lbl_gesture"
  top: "bump_1/loss1/loss"
  loss_weight: 0.3
}
layer {
  name: "bump_1/loss1/top-1"
  type: "Accuracy"
  bottom: "bump_1/loss1/classifier"
  bottom: "bump_1/lbl_gesture"
  top: "bump_1/loss1/accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "bump_1/loss1/top-5"
  type: "Accuracy"
  bottom: "bump_1/loss1/classifier"
  bottom: "bump_1/lbl_gesture"
  top: "bump_1/loss1/accuracy-top5"
  include {
    phase: TEST
  }
  accuracy_param {
    top_k: 5
  }
}
layer {
  name: "bump_1/inception_4b/1x1"
  type: "Convolution"
  bottom: "bump_1/inception_4a/output"
  top: "bump_1/inception_4b/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4b/relu_1x1"
  type: "ReLU"
  bottom: "bump_1/inception_4b/1x1"
  top: "bump_1/inception_4b/1x1"
}
layer {
  name: "bump_1/inception_4b/3x3_reduce"
  type: "Convolution"
  bottom: "bump_1/inception_4a/output"
  top: "bump_1/inception_4b/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.09
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_4b/3x3_reduce"
  top: "bump_1/inception_4b/3x3_reduce"
}
layer {
  name: "bump_1/inception_4b/3x3"
  type: "Convolution"
  bottom: "bump_1/inception_4b/3x3_reduce"
  top: "bump_1/inception_4b/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 224
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4b/relu_3x3"
  type: "ReLU"
  bottom: "bump_1/inception_4b/3x3"
  top: "bump_1/inception_4b/3x3"
}
layer {
  name: "bump_1/inception_4b/5x5_reduce"
  type: "Convolution"
  bottom: "bump_1/inception_4a/output"
  top: "bump_1/inception_4b/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.2
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_4b/5x5_reduce"
  top: "bump_1/inception_4b/5x5_reduce"
}
layer {
  name: "bump_1/inception_4b/5x5"
  type: "Convolution"
  bottom: "bump_1/inception_4b/5x5_reduce"
  top: "bump_1/inception_4b/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4b/relu_5x5"
  type: "ReLU"
  bottom: "bump_1/inception_4b/5x5"
  top: "bump_1/inception_4b/5x5"
}
layer {
  name: "bump_1/inception_4b/pool"
  type: "Pooling"
  bottom: "bump_1/inception_4a/output"
  top: "bump_1/inception_4b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "bump_1/inception_4b/pool_proj"
  type: "Convolution"
  bottom: "bump_1/inception_4b/pool"
  top: "bump_1/inception_4b/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4b/relu_pool_proj"
  type: "ReLU"
  bottom: "bump_1/inception_4b/pool_proj"
  top: "bump_1/inception_4b/pool_proj"
}
layer {
  name: "bump_1/inception_4b/output"
  type: "Concat"
  bottom: "bump_1/inception_4b/1x1"
  bottom: "bump_1/inception_4b/3x3"
  bottom: "bump_1/inception_4b/5x5"
  bottom: "bump_1/inception_4b/pool_proj"
  top: "bump_1/inception_4b/output"
}
layer {
  name: "bump_1/inception_4c/1x1"
  type: "Convolution"
  bottom: "bump_1/inception_4b/output"
  top: "bump_1/inception_4c/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4c/relu_1x1"
  type: "ReLU"
  bottom: "bump_1/inception_4c/1x1"
  top: "bump_1/inception_4c/1x1"
}
layer {
  name: "bump_1/inception_4c/3x3_reduce"
  type: "Convolution"
  bottom: "bump_1/inception_4b/output"
  top: "bump_1/inception_4c/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.09
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4c/relu_3x3_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_4c/3x3_reduce"
  top: "bump_1/inception_4c/3x3_reduce"
}
layer {
  name: "bump_1/inception_4c/3x3"
  type: "Convolution"
  bottom: "bump_1/inception_4c/3x3_reduce"
  top: "bump_1/inception_4c/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4c/relu_3x3"
  type: "ReLU"
  bottom: "bump_1/inception_4c/3x3"
  top: "bump_1/inception_4c/3x3"
}
layer {
  name: "bump_1/inception_4c/5x5_reduce"
  type: "Convolution"
  bottom: "bump_1/inception_4b/output"
  top: "bump_1/inception_4c/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 24
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.2
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4c/relu_5x5_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_4c/5x5_reduce"
  top: "bump_1/inception_4c/5x5_reduce"
}
layer {
  name: "bump_1/inception_4c/5x5"
  type: "Convolution"
  bottom: "bump_1/inception_4c/5x5_reduce"
  top: "bump_1/inception_4c/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4c/relu_5x5"
  type: "ReLU"
  bottom: "bump_1/inception_4c/5x5"
  top: "bump_1/inception_4c/5x5"
}
layer {
  name: "bump_1/inception_4c/pool"
  type: "Pooling"
  bottom: "bump_1/inception_4b/output"
  top: "bump_1/inception_4c/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "bump_1/inception_4c/pool_proj"
  type: "Convolution"
  bottom: "bump_1/inception_4c/pool"
  top: "bump_1/inception_4c/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4c/relu_pool_proj"
  type: "ReLU"
  bottom: "bump_1/inception_4c/pool_proj"
  top: "bump_1/inception_4c/pool_proj"
}
layer {
  name: "bump_1/inception_4c/output"
  type: "Concat"
  bottom: "bump_1/inception_4c/1x1"
  bottom: "bump_1/inception_4c/3x3"
  bottom: "bump_1/inception_4c/5x5"
  bottom: "bump_1/inception_4c/pool_proj"
  top: "bump_1/inception_4c/output"
}
layer {
  name: "bump_1/inception_4d/1x1"
  type: "Convolution"
  bottom: "bump_1/inception_4c/output"
  top: "bump_1/inception_4d/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 112
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4d/relu_1x1"
  type: "ReLU"
  bottom: "bump_1/inception_4d/1x1"
  top: "bump_1/inception_4d/1x1"
}
layer {
  name: "bump_1/inception_4d/3x3_reduce"
  type: "Convolution"
  bottom: "bump_1/inception_4c/output"
  top: "bump_1/inception_4d/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 144
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.09
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4d/relu_3x3_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_4d/3x3_reduce"
  top: "bump_1/inception_4d/3x3_reduce"
}
layer {
  name: "bump_1/inception_4d/3x3"
  type: "Convolution"
  bottom: "bump_1/inception_4d/3x3_reduce"
  top: "bump_1/inception_4d/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 288
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4d/relu_3x3"
  type: "ReLU"
  bottom: "bump_1/inception_4d/3x3"
  top: "bump_1/inception_4d/3x3"
}
layer {
  name: "bump_1/inception_4d/5x5_reduce"
  type: "Convolution"
  bottom: "bump_1/inception_4c/output"
  top: "bump_1/inception_4d/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.2
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4d/relu_5x5_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_4d/5x5_reduce"
  top: "bump_1/inception_4d/5x5_reduce"
}
layer {
  name: "bump_1/inception_4d/5x5"
  type: "Convolution"
  bottom: "bump_1/inception_4d/5x5_reduce"
  top: "bump_1/inception_4d/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4d/relu_5x5"
  type: "ReLU"
  bottom: "bump_1/inception_4d/5x5"
  top: "bump_1/inception_4d/5x5"
}
layer {
  name: "bump_1/inception_4d/pool"
  type: "Pooling"
  bottom: "bump_1/inception_4c/output"
  top: "bump_1/inception_4d/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "bump_1/inception_4d/pool_proj"
  type: "Convolution"
  bottom: "bump_1/inception_4d/pool"
  top: "bump_1/inception_4d/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4d/relu_pool_proj"
  type: "ReLU"
  bottom: "bump_1/inception_4d/pool_proj"
  top: "bump_1/inception_4d/pool_proj"
}
layer {
  name: "bump_1/inception_4d/output"
  type: "Concat"
  bottom: "bump_1/inception_4d/1x1"
  bottom: "bump_1/inception_4d/3x3"
  bottom: "bump_1/inception_4d/5x5"
  bottom: "bump_1/inception_4d/pool_proj"
  top: "bump_1/inception_4d/output"
}
layer {
  name: "bump_1/loss2/ave_pool"
  type: "Pooling"
  bottom: "bump_1/inception_4d/output"
  top: "bump_1/loss2/ave_pool"
  pooling_param {
    pool: AVE
    kernel_size: 5
    stride: 3
  }
}
layer {
  name: "bump_1/loss2/conv"
  type: "Convolution"
  bottom: "bump_1/loss2/ave_pool"
  top: "bump_1/loss2/conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.08
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/loss2/relu_conv"
  type: "ReLU"
  bottom: "bump_1/loss2/conv"
  top: "bump_1/loss2/conv"
}
layer {
  name: "bump_1/loss2/fc"
  type: "InnerProduct"
  bottom: "bump_1/loss2/conv"
  top: "bump_1/loss2/fc"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "xavier"
      std: 0.02
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/loss2/relu_fc"
  type: "ReLU"
  bottom: "bump_1/loss2/fc"
  top: "bump_1/loss2/fc"
}
layer {
  name: "bump_1/loss2/drop_fc"
  type: "Dropout"
  bottom: "bump_1/loss2/fc"
  top: "bump_1/loss2/fc"
  dropout_param {
    dropout_ratio: 0.7
  }
}
layer {
  name: "bump_1/loss2/classifier"
  type: "InnerProduct"
  bottom: "bump_1/loss2/fc"
  top: "bump_1/loss2/classifier"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 20
    weight_filler {
      type: "xavier"
      std: 0.0009765625
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "bump_1/loss2/loss"
  type: "SoftmaxWithLoss"
  bottom: "bump_1/loss2/classifier"
  bottom: "bump_1/lbl_gesture"
  top: "bump_1/loss2/loss"
  loss_weight: 0.3
}
layer {
  name: "bump_1/loss2/top-1"
  type: "Accuracy"
  bottom: "bump_1/loss2/classifier"
  bottom: "bump_1/lbl_gesture"
  top: "bump_1/loss2/accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "bump_1/loss2/top-5"
  type: "Accuracy"
  bottom: "bump_1/loss2/classifier"
  bottom: "bump_1/lbl_gesture"
  top: "bump_1/loss2/accuracy-top5"
  include {
    phase: TEST
  }
  accuracy_param {
    top_k: 5
  }
}
layer {
  name: "bump_1/inception_4e/1x1"
  type: "Convolution"
  bottom: "bump_1/inception_4d/output"
  top: "bump_1/inception_4e/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4e/relu_1x1"
  type: "ReLU"
  bottom: "bump_1/inception_4e/1x1"
  top: "bump_1/inception_4e/1x1"
}
layer {
  name: "bump_1/inception_4e/3x3_reduce"
  type: "Convolution"
  bottom: "bump_1/inception_4d/output"
  top: "bump_1/inception_4e/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.09
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4e/relu_3x3_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_4e/3x3_reduce"
  top: "bump_1/inception_4e/3x3_reduce"
}
layer {
  name: "bump_1/inception_4e/3x3"
  type: "Convolution"
  bottom: "bump_1/inception_4e/3x3_reduce"
  top: "bump_1/inception_4e/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4e/relu_3x3"
  type: "ReLU"
  bottom: "bump_1/inception_4e/3x3"
  top: "bump_1/inception_4e/3x3"
}
layer {
  name: "bump_1/inception_4e/5x5_reduce"
  type: "Convolution"
  bottom: "bump_1/inception_4d/output"
  top: "bump_1/inception_4e/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.2
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4e/relu_5x5_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_4e/5x5_reduce"
  top: "bump_1/inception_4e/5x5_reduce"
}
layer {
  name: "bump_1/inception_4e/5x5"
  type: "Convolution"
  bottom: "bump_1/inception_4e/5x5_reduce"
  top: "bump_1/inception_4e/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4e/relu_5x5"
  type: "ReLU"
  bottom: "bump_1/inception_4e/5x5"
  top: "bump_1/inception_4e/5x5"
}
layer {
  name: "bump_1/inception_4e/pool"
  type: "Pooling"
  bottom: "bump_1/inception_4d/output"
  top: "bump_1/inception_4e/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "bump_1/inception_4e/pool_proj"
  type: "Convolution"
  bottom: "bump_1/inception_4e/pool"
  top: "bump_1/inception_4e/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_4e/relu_pool_proj"
  type: "ReLU"
  bottom: "bump_1/inception_4e/pool_proj"
  top: "bump_1/inception_4e/pool_proj"
}
layer {
  name: "bump_1/inception_4e/output"
  type: "Concat"
  bottom: "bump_1/inception_4e/1x1"
  bottom: "bump_1/inception_4e/3x3"
  bottom: "bump_1/inception_4e/5x5"
  bottom: "bump_1/inception_4e/pool_proj"
  top: "bump_1/inception_4e/output"
}
layer {
  name: "bump_1/pool4/3x3_s2"
  type: "Pooling"
  bottom: "bump_1/inception_4e/output"
  top: "bump_1/pool4/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "bump_1/inception_5a/1x1"
  type: "Convolution"
  bottom: "bump_1/pool4/3x3_s2"
  top: "bump_1/inception_5a/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 256
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_5a/relu_1x1"
  type: "ReLU"
  bottom: "bump_1/inception_5a/1x1"
  top: "bump_1/inception_5a/1x1"
}
layer {
  name: "bump_1/inception_5a/3x3_reduce"
  type: "Convolution"
  bottom: "bump_1/pool4/3x3_s2"
  top: "bump_1/inception_5a/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 160
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.09
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_5a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_5a/3x3_reduce"
  top: "bump_1/inception_5a/3x3_reduce"
}
layer {
  name: "bump_1/inception_5a/3x3"
  type: "Convolution"
  bottom: "bump_1/inception_5a/3x3_reduce"
  top: "bump_1/inception_5a/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 320
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_5a/relu_3x3"
  type: "ReLU"
  bottom: "bump_1/inception_5a/3x3"
  top: "bump_1/inception_5a/3x3"
}
layer {
  name: "bump_1/inception_5a/5x5_reduce"
  type: "Convolution"
  bottom: "bump_1/pool4/3x3_s2"
  top: "bump_1/inception_5a/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 32
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.2
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_5a/relu_5x5_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_5a/5x5_reduce"
  top: "bump_1/inception_5a/5x5_reduce"
}
layer {
  name: "bump_1/inception_5a/5x5"
  type: "Convolution"
  bottom: "bump_1/inception_5a/5x5_reduce"
  top: "bump_1/inception_5a/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_5a/relu_5x5"
  type: "ReLU"
  bottom: "bump_1/inception_5a/5x5"
  top: "bump_1/inception_5a/5x5"
}
layer {
  name: "bump_1/inception_5a/pool"
  type: "Pooling"
  bottom: "bump_1/pool4/3x3_s2"
  top: "bump_1/inception_5a/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "bump_1/inception_5a/pool_proj"
  type: "Convolution"
  bottom: "bump_1/inception_5a/pool"
  top: "bump_1/inception_5a/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_5a/relu_pool_proj"
  type: "ReLU"
  bottom: "bump_1/inception_5a/pool_proj"
  top: "bump_1/inception_5a/pool_proj"
}
layer {
  name: "bump_1/inception_5a/output"
  type: "Concat"
  bottom: "bump_1/inception_5a/1x1"
  bottom: "bump_1/inception_5a/3x3"
  bottom: "bump_1/inception_5a/5x5"
  bottom: "bump_1/inception_5a/pool_proj"
  top: "bump_1/inception_5a/output"
}
layer {
  name: "bump_1/inception_5b/1x1"
  type: "Convolution"
  bottom: "bump_1/inception_5a/output"
  top: "bump_1/inception_5b/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 384
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_5b/relu_1x1"
  type: "ReLU"
  bottom: "bump_1/inception_5b/1x1"
  top: "bump_1/inception_5b/1x1"
}
layer {
  name: "bump_1/inception_5b/3x3_reduce"
  type: "Convolution"
  bottom: "bump_1/inception_5a/output"
  top: "bump_1/inception_5b/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.09
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_5b/relu_3x3_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_5b/3x3_reduce"
  top: "bump_1/inception_5b/3x3_reduce"
}
layer {
  name: "bump_1/inception_5b/3x3"
  type: "Convolution"
  bottom: "bump_1/inception_5b/3x3_reduce"
  top: "bump_1/inception_5b/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_5b/relu_3x3"
  type: "ReLU"
  bottom: "bump_1/inception_5b/3x3"
  top: "bump_1/inception_5b/3x3"
}
layer {
  name: "bump_1/inception_5b/5x5_reduce"
  type: "Convolution"
  bottom: "bump_1/inception_5a/output"
  top: "bump_1/inception_5b/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 48
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.2
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_5b/relu_5x5_reduce"
  type: "ReLU"
  bottom: "bump_1/inception_5b/5x5_reduce"
  top: "bump_1/inception_5b/5x5_reduce"
}
layer {
  name: "bump_1/inception_5b/5x5"
  type: "Convolution"
  bottom: "bump_1/inception_5b/5x5_reduce"
  top: "bump_1/inception_5b/5x5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 5
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_5b/relu_5x5"
  type: "ReLU"
  bottom: "bump_1/inception_5b/5x5"
  top: "bump_1/inception_5b/5x5"
}
layer {
  name: "bump_1/inception_5b/pool"
  type: "Pooling"
  bottom: "bump_1/inception_5a/output"
  top: "bump_1/inception_5b/pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "bump_1/inception_5b/pool_proj"
  type: "Convolution"
  bottom: "bump_1/inception_5b/pool"
  top: "bump_1/inception_5b/pool_proj"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_1/inception_5b/relu_pool_proj"
  type: "ReLU"
  bottom: "bump_1/inception_5b/pool_proj"
  top: "bump_1/inception_5b/pool_proj"
}
layer {
  name: "bump_1/inception_5b/output"
  type: "Concat"
  bottom: "bump_1/inception_5b/1x1"
  bottom: "bump_1/inception_5b/3x3"
  bottom: "bump_1/inception_5b/5x5"
  bottom: "bump_1/inception_5b/pool_proj"
  top: "bump_1/inception_5b/output"
}
layer {
  name: "bump_1/pool5/7x7_s1"
  type: "Pooling"
  bottom: "bump_1/inception_5b/output"
  top: "bump_1/pool5/7x7_s1"
  pooling_param {
    pool: AVE
    kernel_size: 7
    stride: 1
  }
}
layer {
  name: "bump_1/pool5/drop_7x7_s1"
  type: "Dropout"
  bottom: "bump_1/pool5/7x7_s1"
  top: "bump_1/pool5/7x7_s1"
  dropout_param {
    dropout_ratio: 0.4
  }
}
layer {
  name: "bump_1/loss3/classifier"
  type: "InnerProduct"
  bottom: "bump_1/pool5/7x7_s1"
  top: "bump_1/loss3/classifier"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  inner_product_param {
    num_output: 20
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}
layer {
  name: "bump_1/loss3/loss"
  type: "SoftmaxWithLoss"
  bottom: "bump_1/loss3/classifier"
  bottom: "bump_1/lbl_gesture"
  top: "bump_1/loss"
  loss_weight: 1.0
}
layer {
  name: "bump_1/loss3/top-1"
  type: "Accuracy"
  bottom: "bump_1/loss3/classifier"
  bottom: "bump_1/lbl_gesture"
  top: "bump_1/accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "bump_1/loss3/top-5"
  type: "Accuracy"
  bottom: "bump_1/loss3/classifier"
  bottom: "bump_1/lbl_gesture"
  top: "bump_1/accuracy-top5"
  include {
    phase: TEST
  }
  accuracy_param {
    top_k: 5
  }
}
layer {
  name: "bump_2/conv1/7x7_s2"
  type: "Convolution"
  bottom: "data"
  top: "bump_2/conv1/7x7_s2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_2/conv1/relu_7x7"
  type: "ReLU"
  bottom: "bump_2/conv1/7x7_s2"
  top: "bump_2/conv1/7x7_s2"
}
layer {
  name: "bump_2/pool1/3x3_s2"
  type: "Pooling"
  bottom: "bump_2/conv1/7x7_s2"
  top: "bump_2/pool1/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "bump_2/pool1/norm1"
  type: "LRN"
  bottom: "bump_2/pool1/3x3_s2"
  top: "bump_2/pool1/norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "bump_2/conv2/3x3_reduce"
  type: "Convolution"
  bottom: "bump_2/pool1/norm1"
  top: "bump_2/conv2/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_2/conv2/relu_3x3_reduce"
  type: "ReLU"
  bottom: "bump_2/conv2/3x3_reduce"
  top: "bump_2/conv2/3x3_reduce"
}
layer {
  name: "bump_2/conv2/3x3"
  type: "Convolution"
  bottom: "bump_2/conv2/3x3_reduce"
  top: "bump_2/conv2/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 192
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_2/conv2/relu_3x3"
  type: "ReLU"
  bottom: "bump_2/conv2/3x3"
  top: "bump_2/conv2/3x3"
}
layer {
  name: "bump_2/conv2/norm2"
  type: "LRN"
  bottom: "bump_2/conv2/3x3"
  top: "bump_2/conv2/norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "bump_2/pool2/3x3_s2"
  type: "Pooling"
  bottom: "bump_2/conv2/norm2"
  top: "bump_2/pool2/3x3_s2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "bump_2/inception_3a/1x1"
  type: "Convolution"
  bottom: "bump_2/pool2/3x3_s2"
  top: "bump_2/inception_3a/1x1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 64
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_2/inception_3a/relu_1x1"
  type: "ReLU"
  bottom: "bump_2/inception_3a/1x1"
  top: "bump_2/inception_3a/1x1"
}
layer {
  name: "bump_2/inception_3a/3x3_reduce"
  type: "Convolution"
  bottom: "bump_2/pool2/3x3_s2"
  top: "bump_2/inception_3a/3x3_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 96
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.09
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_2/inception_3a/relu_3x3_reduce"
  type: "ReLU"
  bottom: "bump_2/inception_3a/3x3_reduce"
  top: "bump_2/inception_3a/3x3_reduce"
}
layer {
  name: "bump_2/inception_3a/3x3"
  type: "Convolution"
  bottom: "bump_2/inception_3a/3x3_reduce"
  top: "bump_2/inception_3a/3x3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
      std: 0.03
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
  name: "bump_2/inception_3a/relu_3x3"
  type: "ReLU"
  bottom: "bump_2/inception_3a/3x3"
  top: "bump_2/inception_3a/3x3"
}
layer {
  name: "bump_2/inception_3a/5x5_reduce"
  type: "Convolution"
  bottom: "bump_2/pool2/3x3_s2"
  top: "bump_2/inception_3a/5x5_reduce"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  param {
    lr_mult: 2.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    kernel_size: 1
    weight_filler {
      type: "xavier"
      std: 0.2
    }
    bias_filler {
      type: "constant"
      value: 0.2
    }
  }
}
layer {
